package com.bupt.mountwutai.customdata;

/**
 * Created by Administrator on 2017/5/23.
 */

public class BroadcastingCenterDate {
    //电视业务
    public static String tv_service = "[{" +
            "    \"date\": \"2016-12-06 14:24:11\"," +
            "    \"posterUrl\": \"static/titleImage/1482802802457-26475.jpg\"," +
            "    \"id\": \"91933\"," +
            "    \"title\": \"电视互动及置换业务\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:26:06\"," +
            "    \"posterUrl\": \"static/titleImage/1482802809649-32986.jpg\"," +
            "    \"id\": \"91934\"," +
            "    \"title\": \"高清节目产品\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:26:26\"," +
            "    \"posterUrl\": \"static/titleImage/1482802816009-81117.jpg\"," +
            "    \"id\": \"91935\"," +
            "    \"title\": \"标清节目产品\"," +
            "    \"isHot\": \"0\"" +
            "}]";

    //电视业务二级页面1
    public static String tv_service_item1 = "[{" +
            "    \"date\": \"2017-02-07 14:24:42\"," +
            "    \"posterUrl\": \"static/titleImage/1486448681610-47293.jpg\"," +
            "    \"fee\": \"420.00元/月\"," +
            "    \"id\": \"8841484\"," +
            "    \"title\": \"标清换高清420套餐\"," +
            "    \"content\": \"标清盒换高清盒，多增39套高清频道，24套标清\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-07 12:10:51\"," +
            "    \"posterUrl\": \"static/titleImage/1489546554157-90558.jpg\"," +
            "    \"fee\": \"468.00元 /12个月\"," +
            "    \"id\": \"8833412\"," +
            "    \"title\": \"爱家互动39元/月套餐\"," +
            "    \"content\": \"39元月包，赠送20M宽带，8套高清付费频道，尽享智能新生活。\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-07 13:38:57\"," +
            "    \"posterUrl\": \"static/titleImage/1489546642711-84036.jpg\"," +
            "    \"fee\": \"696.00元 /12个月\"," +
            "    \"id\": \"8840896\"," +
            "    \"title\": \"爱家互动58元/月套餐\"," +
            "    \"content\": \"互动套餐包58元/月，50M宽带免费送\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-07 11:23:46\"," +
            "    \"posterUrl\": \"static/titleImage/1486437826419-84959.png\"," +
            "    \"fee\": \"96.00元 /12个月\"," +
            "    \"id\": \"8832715\"," +
            "    \"title\": \"互动点播回看96套餐\"," +
            "    \"content\": \"华数点播+时移回看，海量大片随心看。\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 16:39:50\"," +
            "    \"posterUrl\": \"static/titleImage/1486436553628-4691.png\"," +
            "    \"fee\": \"96.00元 /12个月\"," +
            "    \"id\": \"91980\"," +
            "    \"title\": \"互动回看时移96套餐\"," +
            "    \"content\": \"回看：承德地区总共可回看34套频道。时移节目可暂停后退\"," +
            "    \"isHot\": \"0\"" +
            "}]";
    //电视业务二级页面2
    public static String tv_service_item2 = "[{" +
            "    \"date\": \"2017-02-09 14:01:06\"," +
            "    \"posterUrl\": \"static/titleImage/1486620065875-26798.jpg\"," +
            "    \"fee\": \"420.00元 /12个月\"," +
            "    \"id\": \"9012999\"," +
            "    \"title\": \"精品节目420元套餐\"," +
            "    \"content\": \"付费节超级大优惠，打包办理更划算\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-09 14:19:52\"," +
            "    \"posterUrl\": \"static/titleImage/1486621192307-45116.jpg\"," +
            "    \"fee\": \"780.00元 /12个月\"," +
            "    \"id\": \"9061144\"," +
            "    \"title\": \"精品节目780元套餐\"," +
            "    \"content\": \"VIP全节目包，您想看的都在这里\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-09 11:47:58\"," +
            "    \"posterUrl\": \"static/titleImage/1486612077927-21537.png\"," +
            "    \"fee\": \"192.00元 /12个月\"," +
            "    \"id\": \"9008628\"," +
            "    \"title\": \"DOXTV频道\"," +
            "    \"content\": \"美剧、韩剧、好莱坞大片、纪录片、演唱会，统统在这里\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:31:53\"," +
            "    \"posterUrl\": \"static/titleImage/1486611675219-55218.png\"," +
            "    \"fee\": \"192.00元 /12个月\"," +
            "    \"id\": \"91941\"," +
            "    \"title\": \"高清求索\"," +
            "    \"content\": \"高清纪录片爱好者的天堂，涵盖旅游、科学、探险、动物\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:31:17\"," +
            "    \"posterUrl\": \"static/titleImage/1486611607369-74431.png\"," +
            "    \"fee\": \"540.00元 /12个月\"," +
            "    \"id\": \"91940\"," +
            "    \"title\": \"CHC华诚高清\"," +
            "    \"content\": \"高清节目精品，电影不间断，中外大片随心看\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:30:45\"," +
            "    \"posterUrl\": \"static/titleImage/1486611392596-53723.png\"," +
            "    \"fee\": \"540.00元 /12个月\"," +
            "    \"id\": \"91939\"," +
            "    \"title\": \"天华高清\"," +
            "    \"content\": \"高清节目首选天华高清，电影电视剧综艺强档，高清视觉享受\"," +
            "    \"isHot\": \"0\"" +
            "}]";

    //电视业务二级页面3
    public static String tv_service_item3 = "[{" +
            "    \"date\": \"2016-12-06 14:28:01\"," +
            "    \"posterUrl\": \"static/titleImage/1486621702817-75442.png\"," +
            "    \"fee\": \"120.00元 /12个月\"," +
            "    \"id\": \"91937\"," +
            "    \"title\": \"华源影视频道\"," +
            "    \"content\": \"包含3套电影频道，喜欢怀旧电影的老人们不要错过哦\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-06 14:27:12\"," +
            "    \"posterUrl\": \"static/titleImage/1486621630967-35133.png\"," +
            "    \"fee\": \"120.00元 /12个月\"," +
            "    \"id\": \"91936\"," +
            "    \"title\": \"中数标清频道\"," +
            "    \"content\": \"钓鱼、书画、女性、儿童等专业频道，总计24个频道\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-09 14:29:57\"," +
            "    \"posterUrl\": \"static/titleImage/1486621796804-59039.png\"," +
            "    \"fee\": \"120.00元 /12个月\"," +
            "    \"id\": \"9061881\"," +
            "    \"title\": \"军事体育频道\"," +
            "    \"content\": \"国防军事+电子体育，军事迷们和电子竞技爱好者们首选频道\"," +
            "    \"isHot\": \"0\"" +
            "}]";

    //新装业务
    public static String new_clothes_business = "[{" +
            "    \"date\": \"2017-02-08 11:15:52\"," +
            "    \"posterUrl\": \"static/titleImage/1486523752332-29958.jpg\"," +
            "    \"fee\": \"732.00元 /12个月\"," +
            "    \"id\": \"8917117\"," +
            "    \"title\": \"高清初装732元套餐\"," +
            "    \"content\": \"包含32套付费精品频道\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-08 11:08:29\"," +
            "    \"posterUrl\": \"static/titleImage/1489544266733-11104.jpg\"," +
            "    \"fee\": \"996.00元 /24个月\"," +
            "    \"id\": \"8914971\"," +
            "    \"title\": \"高清初装996元套餐\"," +
            "    \"content\": \"高清初装包，包含39套精品付费节目，二年收视费\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-08 10:35:11\"," +
            "    \"posterUrl\": \"static/titleImage/1486521311355-33497.jpg\"," +
            "    \"fee\": \"360.00元/月\"," +
            "    \"id\": \"8912199\"," +
            "    \"title\": \"高清子机360元套餐\"," +
            "    \"content\": \"高清机顶盒，包含12套高清精品频道\"," +
            "    \"isHot\": \"0\"" +
            "}," +
            "{" +
            "    \"date\": \"2017-02-08 10:27:41\"," +
            "    \"posterUrl\": \"static/titleImage/1489544609762-24945.jpg\"," +
            "    \"fee\": \"96.00元 /12个月\"," +
            "    \"id\": \"8911212\"," +
            "    \"title\": \"标清子机96元套餐\"," +
            "    \"content\": \"标清机顶盒免费用，更多精彩节目供您选择\"," +
            "    \"isHot\": \"0\"" +
            "}]";
    //优惠活动
    public static String preferential_activities = "[     {      \"date\":  \"2017-03-15 11:05:54\"," +
            "          \"posterUrl\":  \"static/titleImage/1489547153916-80756.jpg\"," +
            "          \"fee\":  \"468.00元 /12个月\"," +
            "          \"id\":  \"11762126\"," +
            "          \"title\":  \"爱家互动39元/月套餐\"," +
            "          \"content\":  \"爱家互动39元/月套餐   20M宽带免费送\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2017-03-15 11:04:45\"," +
            "          \"posterUrl\":  \"static/titleImage/1489547084816-66151.jpg\"," +
            "          \"fee\":  \"696.00元 /12个月\"," +
            "          \"id\":  \"11762125\"," +
            "          \"title\":  \"爱家互动58元/月套餐\"," +
            "          \"content\":  \"爱家58元/月套餐，50M宽带免费送\"," +
            "          \"isHot\":  \"0\"    " +
            "}  ]";
    //宽带业务
    public static String broadband_business = "[     {      \"date\":  \"2017-02-09 10:17:13\"," +
            "          \"posterUrl\":  \"static/titleImage/1489560106441-22312.jpg\"," +
            "          \"fee\":  \"996.00元 /12个月\"," +
            "          \"id\":  \"8996522\"," +
            "          \"title\":  \"宽带互动初装套餐996元（一年）\"," +
            "          \"content\":  \"电视互动、宽带业务初装套餐\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2017-02-09 10:16:28\"," +
            "          \"posterUrl\":  \"static/titleImage/1489560114782-44327.jpg\"," +
            "          \"fee\":  \"1680.00元 /24个月\"," +
            "          \"id\":  \"8996520\"," +
            "          \"title\":  \"电视宽带初装套餐1680元（二年）\"," +
            "          \"content\":  \"电视和宽带业务初装套餐\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2016-12-06 19:01:53\"," +
            "          \"posterUrl\":  \"static/titleImage/1488264995487-2486.jpg\"," +
            "          \"fee\":  \"380.00元 /12个月\"," +
            "          \"id\":  \"92010\"," +
            "          \"title\":  \"20M宽带一年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2016-12-13 15:19:56\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265004952-53902.jpg\"," +
            "          \"fee\":  \"760.00元 /24个月\"," +
            "          \"id\":  \"92571\"," +
            "          \"title\":  \"20M宽带二年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"1\"    " +
            "}," +
            "     {      \"date\":  \"2016-12-20 14:21:11\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265014388-43611.jpg\"," +
            "          \"fee\":  \"480.00元 /12个月\"," +
            "          \"id\":  \"3415791\"," +
            "          \"title\":  \"50M宽带一年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2016-12-07 09:27:06\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265023017-58653.jpg\"," +
            "          \"fee\":  \"860.00元 /24个月\"," +
            "          \"id\":  \"92049\"," +
            "          \"title\":  \"50M宽带二年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2016-12-20 14:19:46\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265032799-39647.jpg\"," +
            "          \"fee\":  \"680.00元 /12个月\"," +
            "          \"id\":  \"3415790\"," +
            "          \"title\":  \"100M宽带一年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2017-02-09 09:20:10\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265040153-42015.jpg\"," +
            "          \"fee\":  \"980.00元 /24个月\"," +
            "          \"id\":  \"8994109\"," +
            "          \"title\":  \"100M宽带二年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}," +
            "     {      \"date\":  \"2017-02-09 09:21:20\"," +
            "          \"posterUrl\":  \"static/titleImage/1488265047378-50815.jpg\"," +
            "          \"fee\":  \"1280.00元 /36个月\"," +
            "          \"id\":  \"8994112\"," +
            "          \"title\":  \"100M宽带三年包\"," +
            "          \"content\":  \"猫需租金\"," +
            "          \"isHot\":  \"0\"    " +
            "}  ]";
    //营业网点
    public static String business_net = "[{" +
            "    \"date\": \"2016-12-27 09:46:01\"," +
            "    \"address\": \"阳光四季城海棠苑14号楼底商\"," +
            "    \"posterUrl\": \"static/titleImage/1482803161386-52337.jpg\"," +
            "    \"phone\": \"03147035403\"," +
            "    \"id\": \"4795396\"," +
            "    \"title\": \"开发区营业厅\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-27 09:45:12\"," +
            "    \"address\": \"中居宅25号楼3号底商\"," +
            "    \"posterUrl\": \"static/titleImage/1482803111853-30936.jpg\"," +
            "    \"phone\": \"03147035413\"," +
            "    \"id\": \"4795395\"," +
            "    \"title\": \"火车站营业厅\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-16 14:49:12\"," +
            "    \"address\": \"大佟沟文化大厦北塔北门\"," +
            "    \"posterUrl\": \"static/titleImage/1482802960069-30371.jpg\"," +
            "    \"phone\": \"03147035423\"," +
            "    \"id\": \"93022\"," +
            "    \"title\": \"大佟沟营业厅\"" +
            "}]";

}
