package com.bupt.mountwutai.customdata;

/**
 * Created by Administrator on 2017/5/23.
 */

public class BroadcastingCenterDate {
    //电视业务
    public static String tv_service="{\n" +
            "  \"result\": [\n" +
            "    {\n" +
            "      \"date\": \"2016-12-06 14:24:11\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482802802457-26475.jpg\",\n" +
            "      \"id\": \"91933\",\n" +
            "      \"title\": \"电视互动及置换业务\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-06 14:26:06\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482802809649-32986.jpg\",\n" +
            "      \"id\": \"91934\",\n" +
            "      \"title\": \"高清节目产品\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-06 14:26:26\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482802816009-81117.jpg\",\n" +
            "      \"id\": \"91935\",\n" +
            "      \"title\": \"标清节目产品\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"returnCode\": 0,\n" +
            "  \"returnMsg\": \"成功\"\n" +
            "}";
    //新装业务
    public static String new_clothes_business="{\n" +
            "  \"result\": [\n" +
            "    {\n" +
            "      \"date\": \"2017-02-08 11:15:52\",\n" +
            "      \"posterUrl\": \"static/titleImage/1486523752332-29958.jpg\",\n" +
            "      \"fee\": \"732.00元 /12个月\",\n" +
            "      \"id\": \"8917117\",\n" +
            "      \"title\": \"高清初装732元套餐\",\n" +
            "      \"content\": \"包含32套付费精品频道\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-08 11:08:29\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489544266733-11104.jpg\",\n" +
            "      \"fee\": \"996.00元 /24个月\",\n" +
            "      \"id\": \"8914971\",\n" +
            "      \"title\": \"高清初装996元套餐\",\n" +
            "      \"content\": \"高清初装包，包含39套精品付费节目，二年收视费\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-08 10:35:11\",\n" +
            "      \"posterUrl\": \"static/titleImage/1486521311355-33497.jpg\",\n" +
            "      \"fee\": \"360.00元/月\",\n" +
            "      \"id\": \"8912199\",\n" +
            "      \"title\": \"高清子机360元套餐\",\n" +
            "      \"content\": \"高清机顶盒，包含12套高清精品频道\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-08 10:27:41\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489544609762-24945.jpg\",\n" +
            "      \"fee\": \"96.00元 /12个月\",\n" +
            "      \"id\": \"8911212\",\n" +
            "      \"title\": \"标清子机96元套餐\",\n" +
            "      \"content\": \"标清机顶盒免费用，更多精彩节目供您选择\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"returnCode\": 0,\n" +
            "  \"returnMsg\": \"成功\"\n" +
            "}";
    //优惠活动
    public static String preferential_activities="{\n" +
            "  \"result\": [\n" +
            "    {\n" +
            "      \"date\": \"2017-03-15 11:05:54\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489547153916-80756.jpg\",\n" +
            "      \"fee\": \"468.00元 /12个月\",\n" +
            "      \"id\": \"11762126\",\n" +
            "      \"title\": \"爱家互动39元/月套餐\",\n" +
            "      \"content\": \"爱家互动39元/月套餐   20M宽带免费送\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-03-15 11:04:45\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489547084816-66151.jpg\",\n" +
            "      \"fee\": \"696.00元 /12个月\",\n" +
            "      \"id\": \"11762125\",\n" +
            "      \"title\": \"爱家互动58元/月套餐\",\n" +
            "      \"content\": \"爱家58元/月套餐，50M宽带免费送\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"returnCode\": 0,\n" +
            "  \"returnMsg\": \"成功\"\n" +
            "} ";
    //宽带业务
    public static String broadband_business="{\n" +
            "  \"result\": [\n" +
            "    {\n" +
            "      \"date\": \"2017-02-09 10:17:13\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489560106441-22312.jpg\",\n" +
            "      \"fee\": \"996.00元 /12个月\",\n" +
            "      \"id\": \"8996522\",\n" +
            "      \"title\": \"宽带互动初装套餐996元（一年）\",\n" +
            "      \"content\": \"电视互动、宽带业务初装套餐\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-09 10:16:28\",\n" +
            "      \"posterUrl\": \"static/titleImage/1489560114782-44327.jpg\",\n" +
            "      \"fee\": \"1680.00元 /24个月\",\n" +
            "      \"id\": \"8996520\",\n" +
            "      \"title\": \"电视宽带初装套餐1680元（二年）\",\n" +
            "      \"content\": \"电视和宽带业务初装套餐\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-06 19:01:53\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488264995487-2486.jpg\",\n" +
            "      \"fee\": \"380.00元 /12个月\",\n" +
            "      \"id\": \"92010\",\n" +
            "      \"title\": \"20M宽带一年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-13 15:19:56\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265004952-53902.jpg\",\n" +
            "      \"fee\": \"760.00元 /24个月\",\n" +
            "      \"id\": \"92571\",\n" +
            "      \"title\": \"20M宽带二年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"1\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-20 14:21:11\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265014388-43611.jpg\",\n" +
            "      \"fee\": \"480.00元 /12个月\",\n" +
            "      \"id\": \"3415791\",\n" +
            "      \"title\": \"50M宽带一年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-07 09:27:06\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265023017-58653.jpg\",\n" +
            "      \"fee\": \"860.00元 /24个月\",\n" +
            "      \"id\": \"92049\",\n" +
            "      \"title\": \"50M宽带二年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-20 14:19:46\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265032799-39647.jpg\",\n" +
            "      \"fee\": \"680.00元 /12个月\",\n" +
            "      \"id\": \"3415790\",\n" +
            "      \"title\": \"100M宽带一年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-09 09:20:10\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265040153-42015.jpg\",\n" +
            "      \"fee\": \"980.00元 /24个月\",\n" +
            "      \"id\": \"8994109\",\n" +
            "      \"title\": \"100M宽带二年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2017-02-09 09:21:20\",\n" +
            "      \"posterUrl\": \"static/titleImage/1488265047378-50815.jpg\",\n" +
            "      \"fee\": \"1280.00元 /36个月\",\n" +
            "      \"id\": \"8994112\",\n" +
            "      \"title\": \"100M宽带三年包\",\n" +
            "      \"content\": \"猫需租金\",\n" +
            "      \"isHot\": \"0\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"returnCode\": 0,\n" +
            "  \"returnMsg\": \"成功\"\n" +
            "} ";
    //营业网点
    public static String business_net="{\n" +
            "  \"result\": [\n" +
            "    {\n" +
            "      \"date\": \"2016-12-27 09:46:01\",\n" +
            "      \"address\": \"阳光四季城海棠苑14号楼底商\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482803161386-52337.jpg\",\n" +
            "      \"phone\": \"03147035403\",\n" +
            "      \"id\": \"4795396\",\n" +
            "      \"title\": \"开发区营业厅\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-27 09:45:12\",\n" +
            "      \"address\": \"中居宅25号楼3号底商\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482803111853-30936.jpg\",\n" +
            "      \"phone\": \"03147035413\",\n" +
            "      \"id\": \"4795395\",\n" +
            "      \"title\": \"火车站营业厅\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"date\": \"2016-12-16 14:49:12\",\n" +
            "      \"address\": \"大佟沟文化大厦北塔北门\",\n" +
            "      \"posterUrl\": \"static/titleImage/1482802960069-30371.jpg\",\n" +
            "      \"phone\": \"03147035423\",\n" +
            "      \"id\": \"93022\",\n" +
            "      \"title\": \"大佟沟营业厅\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"returnCode\": 0,\n" +
            "  \"returnMsg\": \"正常\"\n" +
            "} ";

}
