package com.bupt.mountwutai.customdata;

/**
 * Created by Administrator on 2017/5/23.
 */

public class BroadcastingCenterDate {
    //电视业务
    public static String tv_service="{" +
            "  \"result\": [" +
            "    {" +
            "      \"date\": \"2016-12-06 14:24:11\"," +
            "      \"posterUrl\": \"static/titleImage/1482802802457-26475.jpg\"," +
            "      \"id\": \"91933\"," +
            "      \"title\": \"电视互动及置换业务\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-06 14:26:06\"," +
            "      \"posterUrl\": \"static/titleImage/1482802809649-32986.jpg\"," +
            "      \"id\": \"91934\"," +
            "      \"title\": \"高清节目产品\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-06 14:26:26\"," +
            "      \"posterUrl\": \"static/titleImage/1482802816009-81117.jpg\"," +
            "      \"id\": \"91935\"," +
            "      \"title\": \"标清节目产品\"," +
            "      \"isHot\": \"0\"" +
            "    }" +
            "  ]," +
            "  \"returnCode\": 0," +
            "  \"returnMsg\": \"成功\"" +
            "}";
    //新装业务
    public static String new_clothes_business="{" +
            "  \"result\": [" +
            "    {" +
            "      \"date\": \"2017-02-08 11:15:52\"," +
            "      \"posterUrl\": \"static/titleImage/1486523752332-29958.jpg\"," +
            "      \"fee\": \"732.00元 /12个月\"," +
            "      \"id\": \"8917117\"," +
            "      \"title\": \"高清初装732元套餐\"," +
            "      \"content\": \"包含32套付费精品频道\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-08 11:08:29\"," +
            "      \"posterUrl\": \"static/titleImage/1489544266733-11104.jpg\"," +
            "      \"fee\": \"996.00元 /24个月\"," +
            "      \"id\": \"8914971\"," +
            "      \"title\": \"高清初装996元套餐\"," +
            "      \"content\": \"高清初装包，包含39套精品付费节目，二年收视费\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-08 10:35:11\"," +
            "      \"posterUrl\": \"static/titleImage/1486521311355-33497.jpg\"," +
            "      \"fee\": \"360.00元/月\"," +
            "      \"id\": \"8912199\"," +
            "      \"title\": \"高清子机360元套餐\"," +
            "      \"content\": \"高清机顶盒，包含12套高清精品频道\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-08 10:27:41\"," +
            "      \"posterUrl\": \"static/titleImage/1489544609762-24945.jpg\"," +
            "      \"fee\": \"96.00元 /12个月\"," +
            "      \"id\": \"8911212\"," +
            "      \"title\": \"标清子机96元套餐\"," +
            "      \"content\": \"标清机顶盒免费用，更多精彩节目供您选择\"," +
            "      \"isHot\": \"0\"" +
            "    }" +
            "  ]," +
            "  \"returnCode\": 0," +
            "  \"returnMsg\": \"成功\"" +
            "}";
    //优惠活动
    public static String preferential_activities="{" +
            "  \"result\": [" +
            "    {" +
            "      \"date\": \"2017-03-15 11:05:54\"," +
            "      \"posterUrl\": \"static/titleImage/1489547153916-80756.jpg\"," +
            "      \"fee\": \"468.00元 /12个月\"," +
            "      \"id\": \"11762126\"," +
            "      \"title\": \"爱家互动39元/月套餐\"," +
            "      \"content\": \"爱家互动39元/月套餐   20M宽带免费送\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-03-15 11:04:45\"," +
            "      \"posterUrl\": \"static/titleImage/1489547084816-66151.jpg\"," +
            "      \"fee\": \"696.00元 /12个月\"," +
            "      \"id\": \"11762125\"," +
            "      \"title\": \"爱家互动58元/月套餐\"," +
            "      \"content\": \"爱家58元/月套餐，50M宽带免费送\"," +
            "      \"isHot\": \"0\"" +
            "    }" +
            "  ]," +
            "  \"returnCode\": 0," +
            "  \"returnMsg\": \"成功\"" +
            "} ";
    //宽带业务
    public static String broadband_business="{" +
            "  \"result\": [" +
            "    {" +
            "      \"date\": \"2017-02-09 10:17:13\"," +
            "      \"posterUrl\": \"static/titleImage/1489560106441-22312.jpg\"," +
            "      \"fee\": \"996.00元 /12个月\"," +
            "      \"id\": \"8996522\"," +
            "      \"title\": \"宽带互动初装套餐996元（一年）\"," +
            "      \"content\": \"电视互动、宽带业务初装套餐\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-09 10:16:28\"," +
            "      \"posterUrl\": \"static/titleImage/1489560114782-44327.jpg\"," +
            "      \"fee\": \"1680.00元 /24个月\"," +
            "      \"id\": \"8996520\"," +
            "      \"title\": \"电视宽带初装套餐1680元（二年）\"," +
            "      \"content\": \"电视和宽带业务初装套餐\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-06 19:01:53\"," +
            "      \"posterUrl\": \"static/titleImage/1488264995487-2486.jpg\"," +
            "      \"fee\": \"380.00元 /12个月\"," +
            "      \"id\": \"92010\"," +
            "      \"title\": \"20M宽带一年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-13 15:19:56\"," +
            "      \"posterUrl\": \"static/titleImage/1488265004952-53902.jpg\"," +
            "      \"fee\": \"760.00元 /24个月\"," +
            "      \"id\": \"92571\"," +
            "      \"title\": \"20M宽带二年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"1\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-20 14:21:11\"," +
            "      \"posterUrl\": \"static/titleImage/1488265014388-43611.jpg\"," +
            "      \"fee\": \"480.00元 /12个月\"," +
            "      \"id\": \"3415791\"," +
            "      \"title\": \"50M宽带一年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-07 09:27:06\"," +
            "      \"posterUrl\": \"static/titleImage/1488265023017-58653.jpg\"," +
            "      \"fee\": \"860.00元 /24个月\"," +
            "      \"id\": \"92049\"," +
            "      \"title\": \"50M宽带二年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2016-12-20 14:19:46\"," +
            "      \"posterUrl\": \"static/titleImage/1488265032799-39647.jpg\"," +
            "      \"fee\": \"680.00元 /12个月\"," +
            "      \"id\": \"3415790\"," +
            "      \"title\": \"100M宽带一年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-09 09:20:10\"," +
            "      \"posterUrl\": \"static/titleImage/1488265040153-42015.jpg\"," +
            "      \"fee\": \"980.00元 /24个月\"," +
            "      \"id\": \"8994109\"," +
            "      \"title\": \"100M宽带二年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }," +
            "    {" +
            "      \"date\": \"2017-02-09 09:21:20\"," +
            "      \"posterUrl\": \"static/titleImage/1488265047378-50815.jpg\"," +
            "      \"fee\": \"1280.00元 /36个月\"," +
            "      \"id\": \"8994112\"," +
            "      \"title\": \"100M宽带三年包\"," +
            "      \"content\": \"猫需租金\"," +
            "      \"isHot\": \"0\"" +
            "    }" +
            "  ]," +
            "  \"returnCode\": 0," +
            "  \"returnMsg\": \"成功\"" +
            "} ";
    //营业网点
    public static String business_net="[{" +
            "    \"date\": \"2016-12-27 09:46:01\"," +
            "    \"address\": \"阳光四季城海棠苑14号楼底商\"," +
            "    \"posterUrl\": \"static/titleImage/1482803161386-52337.jpg\"," +
            "    \"phone\": \"03147035403\"," +
            "    \"id\": \"4795396\"," +
            "    \"title\": \"开发区营业厅\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-27 09:45:12\"," +
            "    \"address\": \"中居宅25号楼3号底商\"," +
            "    \"posterUrl\": \"static/titleImage/1482803111853-30936.jpg\"," +
            "    \"phone\": \"03147035413\"," +
            "    \"id\": \"4795395\"," +
            "    \"title\": \"火车站营业厅\"" +
            "}," +
            "{" +
            "    \"date\": \"2016-12-16 14:49:12\"," +
            "    \"address\": \"大佟沟文化大厦北塔北门\"," +
            "    \"posterUrl\": \"static/titleImage/1482802960069-30371.jpg\"," +
            "    \"phone\": \"03147035423\"," +
            "    \"id\": \"93022\"," +
            "    \"title\": \"大佟沟营业厅\"" +
            "}]";

}
