package com.bupt.mountwutai.customdata;

import com.bupt.mountwutai.R;

/**
 * 佛事-模块里面的数据，
 * Created by litf on 2017/5/11.
 */

public class BuddhismData {
    //佛事活动--图文列表
    public static int[] buddhism_activity_icon = new int[]{R.mipmap.b_jiayoukaosheng, R.mipmap.b_wuyeshengri, R.mipmap.b_shuilufahui};
    public static String[] buddhism_activity_title = new String[]{"2017-家有考生|文殊道场五台山供灯祈福","五爷生日|我为五爷披龙袍","五台山龙泉寺水陆法会功德圆满"};
    public static boolean[] buddhism_activity_isBegin = new boolean[]{false,true,true};
    //佛事活动--图文列表的详情
    public static int[] buddhism_detail_icon = new int[]{R.mipmap.b_kaosheng,R.mipmap.b_wuye};
    public static String[] buddhism_detail_content = new String[]{"2017-家有考生|文殊道场五台山供灯祈福","　　三世觉母妙吉祥， 七佛之师智慧身。\n" +
            "　　智镜高悬施法雨， 慧灯遍照应群机。\n\n" +
            "　　农历四月初四（2017年4月29日）是大智文殊菩萨圣诞日。文殊菩萨是七佛之师、诸佛之母，是一切如来智慧的集中显现。世界佛教圣地五台山是代表聪明智慧的文殊菩萨的道场，因此更受考生家长的青睐，成为高考祈福胜地。每年4月初4（文殊菩萨圣诞日）都会有成千上万的信善来五台山供灯祈福。\n" +
            "　　为祈福即将面临中考、高考的考生，在殊胜的日子为孩子祈福开智增慧，由于很多朋友们无法亲赴法会，届时，智慧五台山开通五台山文殊圣诞日供灯祈福直播。我们诚邀您观看网络直播，共同祈福，同沐佛光。"};
    public static String[] buddhism_detail_content2 = new String[]{"五爷的传说","　　五爷是五台山特有的神灵，关于其来历还有这样一个传说；原来的五台山是荒凉炎热的，后来文殊菩萨到东海龙那借来清凉石，就成为现在的清凉避暑胜地，然事情并没有因此而结束。东海龙王有五个儿子，其中老五性格暴躁、面容乌黑，人称黑脸五爷。他们播布降雨回来后又累又热，都要回来在歇凉石上歇一歇。这天，他们布雨回来后发现歇凉石不见了，经过询问后得知被文殊菩萨带到了五台山，便怒气冲冲来向其讨要。由于他们不是文殊菩萨的对手，被降服后便安排到五台山的五个台顶掌管播布降雨，其中五爷被分配到北台顶。由于北台顶终年积雪、道路险峻人们朝拜很不方便。到了清代为了朝拜方便，人们便把五爷请到现在所在的地方——万佛阁【俗称五爷庙】。大殿正中供奉着五爷的塑像，在他的两边分别是他的四位哥哥以及龙母和雨师。大家还可以看到五爷不仅身披龙袍旁边还有半副銮驾，这是因为当年他救驾有功，康熙皇帝感念其恩德御赐的，还亲笔题写了“龙参”二字"
    ,"平时如何到五爷庙拜佛许愿",
            "　　有信众问：什么时候去五台山五爷庙拜最灵？什么时间到五台山五爷庙许愿最灵？就相关问题请教了五台山五爷庙的一些僧侣，答复如下：\n" +
                    "　　1 子时：子时进入五爷庙进香称之为“烧头香”，表示一天当中第一时间参拜五爷，得到的五爷的加持力也最强，因此许多信众不远万里感到五爷庙烧头香。\n" +
                    "　　2 初一、十五：初一、十五为佛教界敬香、礼佛的日子，因此每到这几天，五爷庙人头涌动，万人进香，表达对五爷庙护佑的感谢。\n" +
                    "　　3 五爷圣诞日：就是农历的五月十三日，这天是五台山最隆重的日子，这天如果您能到五爷庙参访那一定会得到五爷更大的加持与护佑。\n" +
                    "　　4 如果您能在五爷圣诞这天烧头香、或初一十五烧头香那更是表示对五爷的尊敬。\n" +
                    "\n" +
                    "　　另外注意：烧头香务必预约才能成功，每天五爷庙烧头香的人非常多，因此要做好计划才能顺利完成您的许愿礼佛之行。\n" +
                    "　　(一)许愿方式\n" +
                    "　　♦1、点佛前灯：可以点一对，也可以点三六九个，或九的倍数，象征祈福，心明眼亮。\n" +
                    "　　♦2、敬香：表示对佛菩萨的尊敬，虔诚恭敬供养三宝;传递信息于虚空法界，感通十方三宝加持，旨在与佛菩萨心意相通。\n" +
                    "　　♦3、大拜礼：敬佛法僧三宝。默许心愿后，拜别佛菩萨。\n" +
                    "　　(二)还愿方式\n" +
                    "　　♦1、 请戏班子为五爷唱大戏\n" +
                    "　　据说五爷非常爱看戏，所以人们在供奉五爷的正殿对面搭建了一座别致典雅的戏台，专门为五爷唱戏。据悉，多年来每逢农历六月，五爷庙都会大开殿门，请名角，唱好戏，让五爷居高观赏，以求五爷普济天下，风调雨顺，五谷丰登。很多人在愿望实现之后也会出钱请戏班子来为五爷唱戏，期间任何人都可自由出入免费观赏。每年的6、7、8、9月份是五爷庙愿戏最为兴盛之时，届时五爷庙里几乎天天有戏，且基本上是台连台、折连折。\n" +
                    "　　♦2、 为五爷挂牌匾\n" +
                    "　　在五爷庙正殿上方挂一块牌匾，上写“感谢神恩、五爷恩泽”等字样，并且把自己的名字和地址写在上面。据说现在已经挂了不少了，并且还要经常替换。\n" +
                    "　　♦3、为五爷披龙袍\n" +
                    "　　五爷本身是身披龙袍的，很多人实现愿望以后选择为五爷披龙袍，相当于是为五爷做了一件新衣服的意思。在台怀镇的商店有专供五爷的龙袍，提早请回来，披于五爷即可。\n" +
                    "　　♦4、贴金\n" +
                    "　　功过捐赠给五爷贴金，金额按照您许愿时的即可。\n" +
                    "　　(三)五爷庙许愿还愿小贴士\n" +
                    "　　♦1、时间的选择\n" +
                    "　　优先选择五爷的生日(即农历五月十三)，那天寺庙会有隆重的法会庆祝五爷的诞辰。其次选初一或十五月圆之日，也是善男信女们朝山礼佛的重要日子，可在零点时去烧头香。当然如果您工作繁忙不能在上述时间到五爷庙许愿，只要挑您认为合适的日子，也可前来许愿。一般在早上11点前空腹前去，以示对五爷的尊敬。\n" +
                    "　　♦2、 进香\n" +
                    "　　进入寺庙之前首先要进香，香烟缭绕，烟雾袅袅，燃香是沟通您和五爷的桥梁，进香就是和神佛进行沟通。燃香时将点燃的香举过头顶以示对五爷的尊重，并且鞠躬叩拜，东南西北四个方向每一个方向鞠躬三次，因为五台山是佛教圣地，四面均有佛。最后将点燃的香放入香炉内即可排队进入寺庙，到五爷像前叩拜许愿或还愿。\n" +
                    "　　♦3、许愿还愿\n" +
                    "　　到五爷庙最多可许三个愿望，且许愿必须要还愿，愿望达成后要在一年内来还愿。\n\n"
    };
}
