package com.bupt.mountwutai.customdata;

import com.bupt.mountwutai.R;

/**
 * 概览模块里面的数据，
 * Created by litf on 2017/4/19.
 */

public class SummaryData {
    //寺庙一览数据
    public static int[] temple_icon = new int[]{R.mipmap.ic_launcher, R.mipmap.ic_launcher, R.mipmap.ic_launcher, R.mipmap.ic_launcher};
    public static String[] temple_title = new String[]{"南山寺", "塔院寺", "佛光寺", "显通寺"};
    public static String[] temple_content = new String[]{"始于元代，修缮于清末，历史久远。南山寺引人入胜之处是它的气魄、石雕和泥塑。五台山寺院多有影壁，而南山寺最下面这一影壁是最大的...",
            "塔院寺是五台山著名的五大禅处之一，原来是显通寺的塔院，明代重修舍利塔后独成一寺，因院内有大白塔，故名塔院寺。 耸入云天的大白塔...",
            "五台山佛光寺属全国重点文物保护单位，位于山西五台县佛光新村，距县城30公里。因此寺历史悠久，寺内佛教文物珍贵，故有“亚洲佛光”之...",
            "显通寺现占地面积约120亩，各种建筑400余座，规模浩大。周围山峦起伏，寺内殿阁巍峨，兼有苍松翠柏参插其间，佛教气息浓郁。在全寺中..."};

    //地方风情数据
    public static int[] localCustom_img = new int[]{R.mipmap.ic_launcher};
    public static String[] localCustom_text = new String[]{"      五台山作为中国四大佛教名山之首，其周边地区的民俗风情既秉承了山西传统的民俗习惯，也融合了佛教文化，形成了五台山独特的当地的民俗。\n" +
            "　　五台山春节期间的民俗最多，当地人也是忙的不亦乐乎，贴窗花、垒旺火、接财神、迎喜神、逛庙会、寺庙祈福等。还有扭秧歌、耍社火、八音会等传统的民俗节目。在五台山上的寺庙里也有很多的法会。                    \n" +
            "      在春节前后的六天里，是五台山最热闹的，各个寺庙都会举办纪念弥勒菩萨的法会和僧众拜万佛、放禄马、拜五方文殊等寺庙活动。从正月十五到元宵节还会有一系列的法会活动，游客和香客们可以尽情..."};

    //佛教圣地数据
    public static int[] buddhist_holy_land_img = new int[]{R.mipmap.ic_launcher};
    public static String[] buddhist_holy_land_text = new String[]{"      始于元代，修缮于清末，历史久远。南山寺引人入胜之处是它的气魄、石雕和泥塑。五台山寺院多有影壁，而南山寺最下面这一影壁是最大的，石砌底座，细磨青砖筑壁身，中嵌汉白玉石雕，多有题词和对联，顶部壁檐有砖雕。 南山寺有一独特之处，我国其..."};

    //历史传说数据
    public static int[] historic_legends_img = new int[]{R.mipmap.ic_launcher};
    public static String[] historic_legends_text = new String[]{"      相传五台山原名五峰山，气候异常恶劣，冬天滴水成冰，春天飞沙走石，夏天酷热难当，农民们根本无法到田里种庄稼。文殊菩萨碰巧到这里传教，看到人们遭受苦难，决定改变这里的气候。\n" +
            "      文殊菩萨了解到东海龙王那里有一块神石叫“歇龙石”，可以把干燥的气候变得湿润，于是变成一个化缘的和尚，到龙王那里借歇龙石。\n" +
            "      文殊菩萨来到东海，见龙宫外面果然有一块巨石。还没有走到跟前，已经感觉到一股凉气迎面扑来。文殊菩萨见到龙王，说明来意。龙王很抱歉地说：“大法师借什么都行，唯独这块歇龙石不能借。因为..."};

    //五台食谱数据
    public static int[] wutai_icon = new int[]{R.mipmap.wutairecipes1, R.mipmap.wutairecipes2,
            R.mipmap.wutairecipes3, R.mipmap.wutairecipes4,R.mipmap.wutairecipes5, R.mipmap.wutairecipes6,
            R.mipmap.wutairecipes7};
    public static String[] wutai_title = new String[]{"拨烂子", "过油山药", "高粱面鱼鱼", "繁峙疤饼",
    "砍三刀","忻州瓦酥","神池麻花"};
    public static String[] wutai_content = new String[]{"拨烂子以土豆为主料，也可加入胡罗卜、韭菜等蔬菜一起做。先将土豆擦成鸭舌状的片，切细淋水后均匀撒裹面粉上火蒸熟。加上蔬菜、干辣椒及调味品入锅炝炒即成。",
            "过油山药，除五台之外很少有地方做过，也很少有地方能做的像五台这样好吃，所有的餐馆都有提供，不妨一试。",
            "高梁面鱼鱼是忻州地区乡间百姓粗粮细做的一种日常食品。它是用普通高梁经过淘煮漂晾碾磨成面，用开水和好，人工搓成的。看忻州的农家妇女们搓鱼鱼，可以说是一种艺术享受。",
            "疤饼，因饼上遍布疤痕而名，亦名籽饼。其用料有白面、葫油、白糖、鸡蛋及苏打等。熟后的圆饼呈金黄色，面皮上均匀地布满圆形小坑，状若疤痕，其味香甜，其质酥脆，为别具一格的风味小吃，名闻遐迩。",
            "色呈金黄，绵甜利口，是五台山人春节期间的主要食品之一。每年年关，家家制作，户户蒸食，代代相传，至今已有300多年的历史。在漫长的封建社会里，五台劳动人民生活贫困，常年以玉米为主食。为了改变这种单调乏味的饮食，五台人便创制了一种粗粮细作的食品。炸制时，为使麻油渗入其中，要在上...",
            "它是忻州的地方风味小吃，形状象瓦片，色泽金黄。做法是将鸡蛋、砂糖和食油倒入容器内，搅拌均匀后，和面粉一同和成面团。把软硬适宜的面团擀薄，切成瓦酥条状，在专用模具内，磕制成形。最后放入油锅内炸成金黄色即可。",
            "神池麻花是三晋食品三绝之一。其制作考究、料精货实。主料有面粉、胡麻油和白糖，再加桂花、青梅等十几种小料。需要10道工序发肥、熬糖、配料、制馅、和面、压条、劈条、对条、成型和炸制。好吃，又美观。颜色棕黄，不生不焦，由十根细条组成，内夹各种馅，拧成三个花，犹如妙龄少女的一条长辫子。"};
}
