package com.bupt.mountwutai.customdata;

import com.bupt.mountwutai.R;

/**
 * 概览模块里面的数据，
 * Created by litf on 2017/4/19.
 */

public class SummaryData {
    //寺庙一览数据
    public static int[] temple_icon = new int[]{R.mipmap.g_wuyemiao, R.mipmap.g_nanshansi, R.mipmap.g_tayuansi, R.mipmap.g_foguangsi, R.mipmap.g_xiantongsi};
    public static String[] temple_title = new String[]{"五爷庙", "塔院寺","南山寺", "佛光寺", "显通寺"};
    public static String[] temple_content = new String[]{"五爷庙也称万佛阁座落于台怀镇，与大白塔相毗邻，是通往显通寺的又一条路径。寺庙地势开阔，当年是大清历代皇帝朝台寝宴的行宫，俗称“皇城”。“皇城”至万佛阁之间，终年涌动着接踵\n" +
            "而至的羲圣观光者。",
            "塔院寺是五台山著名的五大禅处之一，原来是显通寺的塔院，明代重修舍利塔后独成一寺，因院内有大白塔，故名塔院寺。 耸入云天的大白塔...",
            "始于元代，修缮于清末，历史久远。南山寺引人入胜之处是它的气魄、石雕和泥塑。五台山寺院多有影壁，而南山寺最下面这一影壁是最大的...",
            "五台山佛光寺属全国重点文物保护单位，位于山西五台县佛光新村，距县城30公里。因此寺历史悠久，寺内佛教文物珍贵，故有“亚洲佛光”之...",
            "显通寺现占地面积约120亩，各种建筑400余座，规模浩大。周围山峦起伏，寺内殿阁巍峨，兼有苍松翠柏参插其间，佛教气息浓郁。在全寺中..."};

    //地方风情数据
    public static int[] localCustom_img = new int[]{R.mipmap.g_difangfengqing};
    public static String[] localCustom_text = new String[]{"　　五台山作为中国四大佛教名山之首，其周边地区的民俗风情既秉承了山西传统的民俗习惯，也融合了佛教文化，形成了五台山独特的当地的民俗。\n" +
            "　　五台山春节期间的民俗最多，当地的人也是忙的不亦乐乎，贴窗花、垒旺火、接财神、迎喜神、逛庙会、寺庙祈福等。还有扭秧歌、耍社火、八音会等传统的民俗节目。在五台山上的寺庙里也有很多的法会。\n" +
            "　　在春节前后的六天里，是五台山最热闹的，各个寺庙都会举办纪念弥勒菩萨的法会和僧众拜万佛、放禄马、拜五方文殊等寺庙活动。从正月十五到元宵节还会有一系列的法会活动，游客和香客们可以尽情参加。在寺庙里，游客可以参加听诵经、吃斋饭、体味1080台阶，和众多的善男信女们一起祈祷祝福，体验一把僧众的生活。借此也可以了解一下五台山的佛教文化。\n" +
            "　　到了六月份，也是五台山比较热闹的时候，六月份有两场大会，都是历年传承下来的。一个是五台山六月骡马大会。六月骡马大会是当地最有名的古庙会，早在隋唐时期就已初具规模，清代达到高峰。举办地就在五台山所在的台怀镇，历时1个月到40天，会上的主要交易品是牲畜。当然，还会有很多的香客游人，期间还会有丰富多彩的文艺节目。\n" +
            "　　还有一个是跳布扎。跳布扎在农历六月十五前后举行，场面震撼。跳布扎来源于藏传佛教，所以都是由寺内喇嘛来举行的，一般会在前一天就开始念护法经，跳金刚舞，在菩萨顶“镇鬼”;当天会有很多喇嘛走出寺庙，穿街绕巷，从菩萨顶一直行进到罗目侯寺。\n"};

    //佛教圣地数据
    public static int[] buddhist_holy_land_img = new int[]{R.mipmap.g_fojiaoshengdi,R.mipmap.g_fojiaoshengdi_ta1,R.mipmap.g_fojiaoshengdi_ta2,R.mipmap.g_fojiaoshengdi_ta3,R.mipmap.g_fojiaoshengdi_ta4,R.mipmap.g_fojiaoshengdi_ta5};
//    public static String[] buddhist_holy_land_text = new String[]{"      塔院寺位於山西省五台山台怀镇的大白塔处，寺以塔名，颇为得体。该寺原为大华严寺塔院。明成祖永乐五年(1407年)扩充建寺，是五台山“五大禅林”之一、全山“青庙十大寺”之一，1983年被国务院确定为汉族地区佛教金国重点寺院。其传承法系既有显密，亦有藏密。塔院寺藏密。塔院寺坐北朝南，由横列的殿院和禅堂僧舍组成。中轴线上的建筑有影壁、牌坊、石阶、周门、山门、钟鼓楼、天王殿、大慈廷寿宝殿、塔殿藏经阁，以及山海楼、文殊发塔等建筑，气魄雄伟，有殿堂楼房一百三十馀间，占地面积15000平方米。在五台山众多佛塔中，塔院寺大白塔最著名，其他诸塔犹如众星捧月一样簇拥着它。大白塔始建於何时，目前已难以稽考。《清凉山志》载，此塔在汉明帝以前就有了。佛教有一传言，公元前486年释迦牟尼佛灭度，其尸骨炼就成八万四千个舍利子，古印度阿育王用黄金七宝铸成了八万四千座佛舍利塔，分布於大千世界中。中国有十九座，五台山独得其一，称之为“慈寿塔”。据说东汉明帝时，西域僧人摩腾就是看到五台山台怀之地似佛祖说之灵鹭山，且此地已有一佛塔才奏明汉明帝在五台山修筑寺院的。由此可知，佛舍利塔，建造於五台山兴建佛寺之初。北魏时显通寺称“大浮图寺”，意即大塔寺，可见大白塔至迟在北魏时期已耸立於五台山了。现在的大白塔，据专家研究，始建於元大德六年（1302年)，由尼泊尔匠师阿权尼哥设计建造，俗称“大白塔”，将以前的慈寿塔置於大塔腹中。该塔工程之大，建造之难，为五台山之冠。建成後，最初作为显通寺的塔院，明永乐五年(1407年)，朱棣命太监杨升重修此塔并独立起寺。明神宗万历（579年)，皇太后李娘娘又令太监范江和李友重建。1952年,由人民政府拨款将塔院寺修旧一新。",
//            "       大白塔位於殿阁之间,旌伟挺拔，直指蓝天,有气盖山河、一览五台之慨。古人称誉此塔:“厥高入云，神灯夜烛，清凉第一胜境也。”塔基为正方形，环周83.3米，通高75.3米。宝塔通体洁白，塔身状如藻瓶，从底到顶，精细相间，方圆搭配，造型优美。塔顶之上，盖铜板八块按乾、坎、艮、震、巽、离、坤、兑八卦地位安置，拼成圆盘形状，其上为风磨铜宝瓶。圆盘周长23米多，铜顶高5米多，从铜顶到铜盘边缘有铜钮固定，望去似北方草帽，南方斗笠。圆盘边缘，还吊装36瑰铜质垂檐，每块长2米馀，宽近1米。各垂檐下端，又挂风铃三个，连同塔腰风铃在内，共有252个。每逢风和日丽，鸟雀围翔，风吹铃响，悠然成韵。明朝镇澄法师;曾有诗先赞曰:“浮图何漂缈，卓出梵王宫。远带青山色，孤标紫界雄。金瓶涵海月，宝铎振天风。自是藏灵久，神邦万古崇”。大白塔是我国建塔史上的一项伟大成就，是我国塔式建筑中少见的珍品和孤例，是研究高层建筑如何经历地震和风雨雷电侵袭而不衰的实物资料。大白塔也是朝圣佛教信徒心目中的偶像。香客多绕行白塔还愿，一边走一边念经或叩头，一边抚转法轮。蒙藏族佛教徒到五台山，首先要朝拜“塔院寺五圣迹”的第一圣迹，就是大白塔。",
//            "       在大白搭东侧，还有一座高两丈余砖构文殊发塔，外抹白灰，通体白净，状如宝葫芦。相传文殊菩萨显圣遗留的金发，就藏其中。大白塔底坐碹洞里有佛足碑。石碑上所刻佛足足印长1．6尺，宽6寸，足心有千幅轮相和宝瓶鱼剑图，十个足趾有华纹字。据下部碑文解释，释迦去世前站在一块大石上，对弟子阿难说:“我最後留此足迹，以示众生。谁见到此足印，瞻礼供养，就能免罪消灾。”唐玄奘取经时，把这佛足印也拓下带回，唐太宗敕令将佛足刻在石上，立於祖庙。明万历王午年秋，寺僧又按图刻石，供养在大白塔下。寺内现存其它蒙、藏、汉文各类碑记数十通。",
//            "       大白塔北侧建有面宽五间，高二层的大藏经阁。正中门顶上挂有一块木匾，上有乾隆皇帝御笔绝句一首:“两塔今惟一尚存，既成必坏有名言。如寻舍利及丝发，未识文殊与世尊。”藏经阁内有一木制经架，叫转轮藏，六角形，33层，高约10米，最上面一层周长11．5米，最下面层周长6．5米，构成上大下小形状，每层分若干小格，放置经书。最下层底下有转盘，人力捱动，能够来回运转。所以制成这种转轮藏，按佛教的说法是转动诵经，能为朝山拜佛者消灾除难。藏经阁现存汉、蒙、藏多种文字经书二万册，其中属於宋以後至乾隆年间版本的二千馀册经卷为国家善本书。",
//            "       五台山塔院寺还与中国革命的领袖们结下不解之缘。寺内方丈院中，至今还设有毛泽东路居陈列馆。室内按原样陈设，炕上铺一床军被，地上摆一张木桌，桌上放有一方砚台，桌子前面有一把木椅，木桌和炕沿中间方台上放有大盒，上架一只铜茶壶。後院东跨三间，左右两间分别是周恩来、任弼时当年路居住室。1948年春天，毛泽东率党中央机关离开延安，路经晋西北，开赴河北省西柏坡。4月9日傍晚时分，来至台怀镇塔院寺。第二天早晨，毛泽弃、周恩来分别由地方干部陪同，观看了寺院文物。毛泽东视察了塔院寺、十方堂寺和蒙藏合作社等处，一路上他亲切地与僧人交谈，关心他们的生活和佛事活动，并勉励地方干部一定要保护好文物，要忠实地执行党的宗教政策，团结爱国僧人，把五台山建设好。周恩来视察了菩萨顶、显通寺、罗喉寺、万佛阁，观看了量墨殿、铜殿、铜塔、“开花献佛”等文物古迹。毛泽东在五台山路居，虽仅有一宿，但在五台山的人民的心中，留下了“春到五台”的美好回忆。",
//            "       塔院寺现任住持如空法师。\n"
//    };
    public static String[] buddhist_holy_land_text = new String[]{"　　五台山的五座山峰分别供奉着文殊菩萨的五个法身，又叫做五方文殊：东台望海寺供聪明文殊、南台普济寺供智慧文殊、西台法雷寺供狮子吼文殊、北台灵应寺供无垢文殊、中台演教寺供孺童文殊。\n" +
        "　　在中国，有佛教四大名山，分别是五台山，峨眉山。普陀山和九华山。在佛教世界，亦有“五大佛教圣地”之说，它们分别是：中国的五台山，尼泊尔的蓝毗尼园、印度的鹿野苑、印度的菩提伽耶和印度的拘尸那。在四大名山与五大圣地中，五台山是唯一一个有交集的地方。\n" +
        "　　五台山位于山西省忻州市五台县，位列中国佛教四大名山之首。是中国唯一一个青庙(汉传佛教)和黄庙(藏传佛教)交相辉映的地方。《名山志》记载：“五台山五峰耸立，高出云表，山顶无林木，有如垒土之台，故曰五台。”\n" +
        "　　据佛经中记载，五台山是文殊菩萨的道场。文殊菩萨是释迦牟尼佛的左胁侍，在佛教中以智慧辩才著称，所以又称大智文殊。他顶结五髻，手持宝剑，骑坐狻猊，象征智慧、锐利、威猛，在四大菩萨中排在头位。因此，他的道场也就特别显赫。\n" +
        "　　五台山有“五台抱一镇”之说。东台望海峰，西台挂月峰，南台锦绣峰，北台叶斗峰，中台翠岩峰，五台之中以北台最高;五峰之外称台外，五峰之内称台内，台内以台怀镇为中心。\n" +
        "　　五台山的五座山峰分别供奉着文殊菩萨的五个法身，又叫做五方文殊：东台望海寺供聪明文殊、南台普济寺供智慧文殊、西台法雷寺供狮子吼文殊、北台灵应寺供无垢文殊、中台演教寺供孺童文殊。\n" +
        "　　据传，五台山曾经拥有寺庙128座，现存寺院共47处，台内39处，台外8处。其中佛光寺和南禅寺是中国现存最早的两座木结构建筑(均建于唐代)，显通寺、塔院寺、菩萨顶、殊像寺、罗睺寺被列为“五台山五大禅处”。\n" +
        "　　除了人文资源外，五台山也有很好的自然景观。壮观的日出和云海，山花灿烂，牛羊成群，山上的五彩经幡随风飘扬。当旭日初升，朝阳投射到寺庙群的砖墙之上，确实有那么几分如入仙境的错觉。\n"
    };


    //历史传说数据
    public static int[] historic_legends_img = new int[]{R.mipmap.g_lishichuanshuo};
    public static String[] historic_legends_text = new String[]{"       相传五台山原名五峰山，气候异常恶劣，冬天滴水成冰，春天飞沙走石，夏天酷热难当，农民们根本无法到田里种庄稼。文殊菩萨碰巧到这里传教，看到人们遭受苦难，决定改变这里的气候。\n" +
            "       文殊菩萨了解到东海龙王那里有一块神石叫“歇龙石”，可以把干燥的气候变得湿润，于是变成一个化缘的和尚，到龙王那里借歇龙石。\n" +
            "       文殊菩萨来到东海，见龙宫外面果然有一块巨石。还没有走到跟前，已经感觉到一股凉气迎面扑来。文殊菩萨见到龙王，说明来意。龙王很抱歉地说：“大法师借什么都行，唯独这块歇龙石不能借。因为它是花了几百年工夫从海底打捞上来的，清凉异常，龙子们每天工作回来，汗水淋漓，燥热难耐，便在上面歇息养神，你若借去，龙子们就没有歇息的地方了。”文殊菩萨反复说明自己是五峰山的和尚，是为了造福于人间特地来求援的。 　　\n" +
            "       龙王心里不愿意把神石借人，又不便直接回绝文殊菩萨的请求。估计这位老和尚一人无法将石头运走，龙王勉强答应说：“神石很重，没有人能帮助你，你如果能拿得动，就拿走吧！” 　　\n" +
            "       文殊菩萨谢过龙王，走到神石跟前，口念咒语，立刻使巨石变成了小小的弹丸。文殊菩萨将弹丸塞进袖筒，然后飘然而去。老龙王惊得目瞪口呆，后悔莫及。 　　\n" +
            "       文殊菩萨回到五峰山时，正是烈日当空，因为久旱不雨，大地干裂，人们遭受着深深的苦难。文殊菩萨把神石安放在山中间的一条山谷中，奇迹发生了：五峰山立刻变成一个清凉无比的天然牧场。于是，这条山谷被命名为清凉谷，人们又在这里建了一座寺院，起名叫清凉寺，五峰山也改名叫作清凉山了。至今，五台山又叫清凉山。 \n" +
            "       五台山风景如画，清凉如水，山峦妩媚，香烟缭绕。每日正午，太阳照群山，五个山台金光四射，大地一片辉煌，就像诸佛开了慧眼一般。生活在五台山的人们安居乐业，吉祥幸福。他们朝听晨钟，夜闻暮鼓，这一切都是五爷为世人开辟出来的好山好水的佛教仙界。 　　相传五爷是东海龙王之子，排行老五，名字叫圣衍。 　　\n" +
            "       传说五爷到五台山游玩，巧遇西天如来佛祖帐下文殊菩萨到五峰山下开辟道场，经文殊菩萨点化，同到东海龙宫借得歇龙石，将原来陡峭险峻的刀削斧劈的五峰山，变成了岿巍敦厚的五个台子，从此，世人改称之为五台山。五台山一改过去那种气候恶劣，冬天寒风刺骨、冰封大地；夏日炎炎、酷暑难挡，而变成常年气候宜人，清爽可爱，夏无酷热，冬无严寒，满山遍绿，花果四季的东方佛教天国，世界佛教圣地。 　　\n" +
            "       据说五爷从此与文殊菩萨一起落户五台山。现如今五台山上有一座气势雄伟的万佛阁，就是由文殊殿、五龙王殿、禅房、戏台四个建筑群组成，如同棋盘，占地两千多平方米，其中五龙王殿中，供奉着大龙王、二龙王、三龙王、龙母、五龙王及雨师，其中五龙王供在殿堂中间突出的位置上。 　　\n" +
            "       自从五龙王落户五台山，五台山周围数百里地方，年年风调雨顺，人民岁岁幸福安康。巍巍五台山，明媚如画，山泉水流潺潺，土沃草茂，牛羊肥壮。五龙王在民间深受世人崇敬，五龙王对众生慈悲为怀，有求必应，世人对五龙王朝拜络绎不绝，五龙王被世人亲切地称为五爷。 　　\n" +
            "       也有传说描述五爷是文殊菩萨的化身，佛法无边，曾救过大清圣主皇帝康熙爷，也曾施恩救过众生。百姓传说五爷有无穷无尽的智慧，有广阔无际的胸怀，五爷怜悯众生，慈悲世人，善男信女供奉五爷，求官得官，求生得子，求财得财，无所不应。供奉五爷，能趋吉化凶，华盖锦旗，胜世妙景，供奉五爷，乐善好施，开智长慧。 　　\n" +
            "       相传五爷还是东海龙宫的财神，总管天下人间收成，世人供奉五爷，为了风调雨顺，世人供奉五爷，为了财源广进，兴旺发达。\n"};

    //首页--佛事
    public static int[] buddhist_main_img = new int[]{R.mipmap.f_yufojie,R.mipmap.f_shusheng};
    public static String[] buddhist_main_text = new String[]{"圣境资讯 l 丁酉释加牟尼佛降诞日 五台山全山各大寺院举行浴佛法会","殊胜节日 l 农历四月初八 恭迎本师释加牟尼佛圣诞"};
    public static String[] buddhist_main_title = new String[]{"浴佛节","殊胜节"};
}
