package com.bupt.mountwutai.customdata;

import com.bupt.mountwutai.R;

/**
 * Created by Wyf on 2017/4/20.
 */

public class WutaiData {

    //五台食谱数据
    public static int[] wutai_icon = new int[]{R.mipmap.wutairecipes1, R.mipmap.wutairecipes2,
            R.mipmap.wutairecipes3, R.mipmap.wutairecipes4,R.mipmap.wutairecipes5, R.mipmap.wutairecipes6,
            R.mipmap.wutairecipes7};
    public static String[] wutai_title = new String[]{"拨烂子", "过油山药", "高粱面鱼鱼", "繁峙疤饼",
            "砍三刀","忻州瓦酥","神池麻花"};
    public static String[] wutai_content = new String[]{"拨烂子以土豆为主料，也可加入胡罗卜、韭菜等蔬菜一起做。先将土豆擦成鸭舌状的片，切细淋水后均匀撒裹面粉上火蒸熟。加上蔬菜、干辣椒及调味品入锅炝炒即成。",
            "过油山药，除五台之外很少有地方做过，也很少有地方能做的像五台这样好吃，所有的餐馆都有提供，不妨一试。",
            "高梁面鱼鱼是忻州地区乡间百姓粗粮细做的一种日常食品。它是用普通高梁经过淘煮漂晾碾磨成面，用开水和好，人工搓成的。看忻州的农家妇女们搓鱼鱼，可以说是一种艺术享受。",
            "疤饼，因饼上遍布疤痕而名，亦名籽饼。其用料有白面、葫油、白糖、鸡蛋及苏打等。熟后的圆饼呈金黄色，面皮上均匀地布满圆形小坑，状若疤痕，其味香甜，其质酥脆，为别具一格的风味小吃，名闻遐迩。",
            "色呈金黄，绵甜利口，是五台山人春节期间的主要食品之一。每年年关，家家制作，户户蒸食，代代相传，至今已有300多年的历史。在漫长的封建社会里，五台劳动人民生活贫困，常年以玉米为主食。为了改变这种单调乏味的饮食，五台人便创制了一种粗粮细作的食品。炸制时，为使麻油渗入其中，要在上...",
            "它是忻州的地方风味小吃，形状象瓦片，色泽金黄。做法是将鸡蛋、砂糖和食油倒入容器内，搅拌均匀后，和面粉一同和成面团。把软硬适宜的面团擀薄，切成瓦酥条状，在专用模具内，磕制成形。最后放入油锅内炸成金黄色即可。",
            "神池麻花是三晋食品三绝之一。其制作考究、料精货实。主料有面粉、胡麻油和白糖，再加桂花、青梅等十几种小料。需要10道工序发肥、熬糖、配料、制馅、和面、压条、劈条、对条、成型和炸制。好吃，又美观。颜色棕黄，不生不焦，由十根细条组成，内夹各种馅，拧成三个花，犹如妙龄少女的一条长辫子。"};
}
